Revit 2027 API
LightFamily.GetLightDistributionStyle Method
 Returns a LightDistributionStyle value for the light distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightDistributionStyle GetLightDistributionStyle()
Public Function GetLightDistributionStyle As LightDistributionStyle
public:
LightDistributionStyle GetLightDistributionStyle()
member GetLightDistributionStyle : unit -> LightDistributionStyle
Return Value
LightDistributionStyle
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace